chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
	#if defined(__32MZ1024ECH100__)
		#define	_CPU_NAME_	"32MZ1024ECH100"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECM100__)
		#define	_CPU_NAME_	"32MZ1024ECM100"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECG100__)
		#define	_CPU_NAME_	"32MZ2048ECG100"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECH100__)
		#define	_CPU_NAME_	"32MZ2048ECH100"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECM100__)
		#define	_CPU_NAME_	"32MZ2048ECM100"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECG124__)
		#define	_CPU_NAME_	"32MZ1024ECG124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECH124__)
		#define	_CPU_NAME_	"32MZ1024ECH124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECM124__)
		#define	_CPU_NAME_	"32MZ1024ECM124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECG124__)
		#define	_CPU_NAME_	"32MZ2048ECG124"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECH124__)
		#define	_CPU_NAME_	"32MZ2048ECH124"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECM124__)
		#define	_CPU_NAME_	"32MZ2048EC124"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECG144__)
		#define	_CPU_NAME_	"32MZ1024ECG144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECH144__)
		#define	_CPU_NAME_	"32MZ1024ECH144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECM144__)
		#define	_CPU_NAME_	"32MZ1024ECM144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECG144__)
		#define	_CPU_NAME_	"32MZ2048ECG144"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECH144__)
		#define	_CPU_NAME_	"32MZ2048ECH144"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ2048ECM144__)
		#define	_CPU_NAME_	"32MZ2048ECM144"
		#define	FLASHEND	(((2048 - 4) * 1024L) - 1)
		#define	RAMEND		((512 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECE064__)
		#define	_CPU_NAME_	"32MZ0512ECE064"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECF064__)
		#define	_CPU_NAME_	"32MZ0512ECF064"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECK064__)
		#define	_CPU_NAME_	"32MZ0512ECK064"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECE064__)
		#define	_CPU_NAME_	"32MZ1024ECE064"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECF064__)
		#define	_CPU_NAME_	"32MZ1024ECF064"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECK064__)
		#define	_CPU_NAME_	"32MZ1024ECK064"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECE100__)
		#define	_CPU_NAME_	"32MZ0512ECE100"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECF100__)
		#define	_CPU_NAME_	"32MZ0512ECF100"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECK100__)
		#define	_CPU_NAME_	"32MZ0512ECK100"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECE100__)
		#define	_CPU_NAME_	"32MZ1024ECE100"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECF100__)
		#define	_CPU_NAME_	"32MZ1024ECF100"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECK100__)
		#define	_CPU_NAME_	"32MZ1024ECK100"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECE124__)
		#define	_CPU_NAME_	"32MZ0512ECE124"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECF124__)
		#define	_CPU_NAME_	"32MZ0512ECF124"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECK124__)
		#define	_CPU_NAME_	"32MZ0512ECK124"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECE124__)
		#define	_CPU_NAME_	"32MZ1024ECE124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECF124__)
		#define	_CPU_NAME_	"32MZ1024ECF124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECK124__)
		#define	_CPU_NAME_	"32MZ1024ECK124"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECE144__)
		#define	_CPU_NAME_	"32MZ0512ECE144"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECF144__)
		#define	_CPU_NAME_	"32MZ0512ECF144"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ0512ECK144__)
		#define	_CPU_NAME_	"32MZ0512ECK144"
		#define	FLASHEND	(((512 - 4) * 1024L) - 1)
		#define	RAMEND		((128 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECE144__)
		#define	_CPU_NAME_	"32MZ1024ECE144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECF144__)
		#define	_CPU_NAME_	"32MZ1024ECF144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif

	#if defined(__32MZ1024ECK144__)
		#define	_CPU_NAME_	"32MZ1024ECK144"
		#define	FLASHEND	(((1024 - 4) * 1024L) - 1)
		#define	RAMEND		((256 * 1024L) - 1)
		#define	__PIC32MZXX__
    #endif
#else
	#error unknown cpu architecture
#endif

//************************************************************************
#ifndef _CPU_NAME_
	#define	_CPU_NAME_	"Unknown"
#endif
